{
  "_meta": {
    "firm": "Your Firm Name",
    "rubric_name": "Call Quality Rubric — Personal Injury Intake",
    "version": "3.0",
    "effective_date": "2026-02-18",
    "last_updated": "2026-02-18",
    "scoring_system": "Each category scored 1-5 (Exceptional=5, Strong=4, Adequate=3, Minimal=2, None=1). Subscores calculated as: (sum of category scores / max possible) × 100.",
    "scoring_note": "Sentiment polarity of agent language must NOT be used to infer quality. Phrases like 'I'm so sorry', 'I apologize', 'That must have been painful' are POSITIVE empathy behaviors and should be rewarded accordingly. SCORING FLOOR: A representative who successfully gathers all required case information AND maintains professional, respectful conduct throughout should receive at least a 3 (Adequate) on each subscore. Scores below 3 must be justified by specific, documentable failures — not merely by the absence of exceptional empathy."
  },
  "categories": [
    {
      "id": "acknowledgment_of_situation",
      "label": "Acknowledgment of Situation",
      "active": true,
      "subscore": "human_element",
      "purpose": "Does the agent explicitly recognize what happened to the caller?",
      "importance": "First impression sets tone for entire call.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Specific acknowledgment with emotional validation AND uses caller's name. Acknowledges within 90 seconds."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Specific acknowledgment with emotional validation, no name used. Timely acknowledgment."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "General acknowledgment without emotional depth, or slightly delayed."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Very brief acknowledgment or jumps to questions immediately."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "No acknowledgment — fully transactional from the start."
        }
      ]
    },
    {
      "id": "validation_of_feelings_and_pain",
      "label": "Validation of Feelings & Pain",
      "active": true,
      "subscore": "human_element",
      "purpose": "Does the agent validate the caller's emotional or physical state?",
      "importance": "Callers who feel heard are more likely to sign.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Multiple specific validations throughout the call, tailored to what caller actually said."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "At least one clear, specific validation during the call."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Generic or formulaic validation — present but not particularly meaningful."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Validation is absent or agent changes topic when caller expresses emotion."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Dismissive — agent interrupts or minimizes caller's feelings."
        }
      ]
    },
    {
      "id": "active_listening",
      "label": "Active Listening",
      "active": true,
      "subscore": "human_element",
      "purpose": "Does the agent demonstrate they are truly listening?",
      "importance": "Directly impacts information quality and caller trust.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "5+ clear listening indicators — paraphrases multiple times, references earlier details, never interrupts (brief overlaps where agent defers don't count)."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "3-4 clear listening indicators — paraphrases, builds on information, good follow-ups."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "1-2 listening indicators — some reflection or follow-up questions."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Mostly reads from script — does not reflect or build on what caller says."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Frequently interrupts and continues speaking over caller, misses key details, asks questions already answered."
        }
      ]
    },
    {
      "id": "patience_with_emotional_callers",
      "label": "Patience with Emotional Callers",
      "active": true,
      "subscore": "human_element",
      "purpose": "How does the agent handle distressed, angry, upset, or slow callers?",
      "importance": "Critical for personal injury callers who are often traumatized.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Allows venting without redirecting, doesn't rush the caller, maintains warm tone, personalizes patience."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Does not escalate, stays professional, waits for caller without audible impatience."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Generally patient but redirects caller back to script a bit quickly."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Audibly or verbally rushed — interrupts venting, redirects before caller is done."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Defensive, irritated, or dismissive tone with distressed caller."
        }
      ]
    },
    {
      "id": "reassurance_and_support",
      "label": "Reassurance & Support",
      "active": true,
      "subscore": "human_element",
      "purpose": "Does the agent provide comfort and confidence about the process and the firm?",
      "importance": "Builds confidence in firm and process.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Multiple specific reassurances that mention the firm's ability to help or normalizes the caller's situation."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "At least one genuine reassurance that positions the firm as an advocate or normalizes the caller's situation."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Scripted or generic reassurance — present but lacks warmth or specificity."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Reassurance is absent or buried — caller left uncertain about next steps."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "No reassurance offered at any point in the call."
        }
      ]
    },
    {
      "id": "appropriate_pacing",
      "label": "Appropriate Pacing",
      "active": true,
      "subscore": "human_element",
      "purpose": "Does the agent match their pace and tone to the caller's emotional and cognitive state? If the agent interrupts, do they recover and allow the client to speak?",
      "importance": "Affects caller comfort and comprehension.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Noticeably slows down for confused or upset callers; adjusts to elderly, non-native speakers, or traumatized callers; uses silence effectively."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Generally appropriate pace — not rushed, follows caller's lead."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Somewhat rushed but not egregious — pace doesn't perfectly match caller's emotional state."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Clearly rushed — fires questions rapidly, doesn't allow processing time."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Rushed throughout — caller sounds overwhelmed or confused as a result."
        }
      ]
    },
    {
      "id": "information_gathering_quality",
      "label": "Information Gathering Quality",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent collect all critical case details effectively?",
      "importance": "Missing information costs the firm time and money.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Collected all critical details, asked clarifying follow-ups, documented accurately, confirmed spelling/dates."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Collected most critical details (8-9 of key items), asked some follow-ups, minor gaps."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Got basic information (6-7 key items) but missed some details or didn't verify."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Significant gaps in information (4-5 key items), didn't ask follow-ups when needed."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Failed to collect critical case information (3 or fewer key items)."
        }
      ]
    },
    {
      "id": "next_steps_clarity",
      "label": "Next Steps Clarity",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent clearly explain what happens after this call?",
      "importance": "Reduces no-shows and caller confusion.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Specific timeline given, explains attorney review process, confirms caller's action items, states who will contact them and when."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Clear next steps with general timeline, confirms action items."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Vague next steps — caller knows something will happen but not exactly what or when."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Barely mentions next steps or only at very end of call."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "No explanation of what happens next — caller left hanging."
        }
      ]
    },
    {
      "id": "professionalism_and_tone",
      "label": "Professionalism & Tone",
      "active": true,
      "subscore": "human_element",
      "purpose": "Did the agent maintain appropriate professional standards throughout the call?",
      "importance": "Reflects on firm's brand and credibility.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Consistently professional, appropriate formality for legal services, warm but not casual, no slang or excessive filler words."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Professional throughout with minor lapses (occasional 'um', 'like')."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Generally professional but some casual language or overly familiar tone."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Frequent casual language, slang, or inappropriately informal tone for legal services."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Unprofessional — curse words, inappropriate comments, disrespectful tone."
        }
      ]
    },
    {
      "id": "call_control_and_efficiency",
      "label": "Call Control & Efficiency",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent guide the conversation effectively without being rushed?",
      "importance": "Balances thoroughness with respect for caller's time.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Smoothly redirected tangents, covered all topics efficiently, natural transitions, appropriate call length for complexity."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Maintained good flow, covered necessary topics, reasonable length."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Some tangents or inefficiency, but got through required information."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Lost control of conversation, excessive tangents, didn't cover all necessary topics."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "No structure — call meandered without clear direction or was inappropriately short."
        }
      ]
    },
    {
      "id": "compliance_and_legal_accuracy",
      "label": "Compliance & Legal Accuracy",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent follow all compliance requirements and avoid unauthorized practice of law?",
      "importance": "CRITICAL — protects firm from liability and ethical violations.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Perfect compliance — all required disclosures made, no legal or medical advice given, appropriate boundaries maintained."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Compliant with minor technical issues (e.g., awkward phrasing of disclaimer)."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Generally compliant but missing one non-critical element."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Multiple compliance issues or one moderate violation (e.g., vague prediction about case)."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "SERIOUS VIOLATION — gave legal advice, promised results, violated confidentiality, or other major compliance failure."
        }
      ]
    },
    {
      "id": "objection_handling",
      "label": "Objection Handling",
      "active": true,
      "subscore": "human_element",
      "purpose": "How effectively did the agent address caller's concerns, doubts, or hesitations?",
      "importance": "Determines whether hesitant callers convert.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Acknowledged concern empathetically, provided reassurance addressing the root issue, moved forward without being pushy."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Addressed concern directly with reasonable explanation."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Acknowledged concern but didn't fully address it, or gave generic response."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Dismissed concern or became defensive."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Ignored objection entirely or pushed aggressively despite caller's clear hesitation."
        }
      ]
    },
    {
      "id": "trust_and_rapport_building",
      "label": "Trust & Rapport Building",
      "active": true,
      "subscore": "human_element",
      "purpose": "Did the agent actively work to build trust and rapport? Did they use techniques like validation, reassurance, and personalization to make the caller feel heard and supported?",
      "importance": "Agents who build rapport increase likelihood caller will sign and stay engaged.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Agent consistently used validation, reassurance, and personalization throughout. Caller explicitly expressed feeling heard, grateful, or relieved — clear evidence agent's efforts succeeded."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Agent demonstrated genuine effort to build rapport through empathy and reassurance. Caller responded positively and was cooperative."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Agent made reasonable effort to build rapport but was somewhat formulaic or missed opportunities to deepen connection."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Agent made minimal effort to build rapport — was transactional or missed clear opportunities to validate or reassure caller."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Agent actively undermined rapport through dismissiveness, impatience, or lack of empathy."
        }
      ]
    },
    {
      "id": "injury_severity_assessment",
      "label": "Injury Severity Assessment",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent ask appropriate questions about injuries and document severity?",
      "importance": "Ensures serious injuries are triaged appropriately.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Asked detailed injury questions, probed for severity, documented treatment thoroughly, showed appropriate concern for serious injuries."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Asked most key injury questions, documented basic treatment info."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Asked about injuries but didn't probe for details or severity."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Briefly asked about injuries but didn't document treatment or severity."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Failed to ask about injuries in a personal injury case OR showed no concern for serious injury."
        }
      ]
    },
    {
      "id": "liability_and_case_viability_awareness",
      "label": "Liability & Case Viability Awareness",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent identify liability factors and potential case viability issues?",
      "importance": "Prevents wasting time on non-viable cases.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Asked all key liability questions, identified red flags early, documented evidence availability."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Asked most liability questions, documented basic fault determination."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Asked who was at fault but didn't probe for evidence or insurance."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Minimal liability assessment — didn't identify obvious red flags."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Failed to assess liability at all OR missed obvious disqualifiers."
        }
      ]
    },
    {
      "id": "documentation_accuracy",
      "label": "Documentation Accuracy",
      "active": true,
      "subscore": "logistics",
      "purpose": "Did the agent accurately capture key details and verify spelling/dates?",
      "importance": "Prevents downstream errors and callbacks.",
      "score_bands": [
        {
          "score": 5,
          "rating": "Exceptional",
          "description": "Confirmed spelling of all names, repeated back phone numbers and addresses, verified dates, corrected errors immediately."
        },
        {
          "score": 4,
          "rating": "Strong",
          "description": "Asked for spelling on difficult names, confirmed at least one critical detail."
        },
        {
          "score": 3,
          "rating": "Adequate",
          "description": "Captured information but didn't verify or confirm."
        },
        {
          "score": 2,
          "rating": "Minimal",
          "description": "Made errors or didn't ask for clarification when needed."
        },
        {
          "score": 1,
          "rating": "None",
          "description": "Multiple errors or failed to capture critical information accurately."
        }
      ]
    }
  ],
  "red_flags": {
    "description": "Each triggered red flag deducts 1 point from the relevant subscore. Multiple red flags stack. Every deduction MUST be documented with a direct transcript quote.",
    "flags": [
      {
        "id": "laughing_or_joking_inappropriately",
        "label": "Laughing or joking inappropriately",
        "active": true,
        "description": "Agent laughs, makes jokes, or uses casual humor while caller describes accident, injuries, or emotional distress.",
        "penalty": -1,
        "subscore": "human_element"
      },
      {
        "id": "blaming_or_doubting_caller",
        "label": "Blaming or doubting the caller",
        "active": true,
        "description": "Agent implies or directly states that caller may be at fault or exaggerating.",
        "penalty": -1,
        "subscore": "human_element"
      },
      {
        "id": "skepticism_about_injuries",
        "label": "Expressing skepticism about injuries",
        "active": true,
        "description": "Agent questions whether injuries are real or as serious as described.",
        "penalty": -1,
        "subscore": "human_element"
      },
      {
        "id": "rushing_distressed_caller",
        "label": "Rushing a clearly distressed caller",
        "active": true,
        "description": "Agent cuts off or rapidly redirects a caller who is crying, upset, or venting.",
        "penalty": -1,
        "subscore": "human_element"
      },
      {
        "id": "unexplained_legal_jargon",
        "label": "Unexplained legal jargon",
        "active": true,
        "description": "Agent uses legal or insurance terms without explanation when caller is clearly confused.",
        "penalty": -1,
        "subscore": "logistics"
      },
      {
        "id": "audible_impatience_or_irritation",
        "label": "Audible impatience or irritation",
        "active": true,
        "description": "Agent sighs, uses curt tone, or otherwise signals frustration with caller.",
        "penalty": -1,
        "subscore": "human_element"
      },
      {
        "id": "inappropriate_disclosure_or_legal_advice",
        "label": "Inappropriate disclosure / giving legal advice",
        "active": true,
        "description": "Agent gives legal advice (predicting outcome, telling caller what to do legally) or makes promises about results.",
        "penalty": -2,
        "subscore": "logistics"
      },
      {
        "id": "failed_to_ask_about_injuries",
        "label": "Failed to ask about injuries in PI case",
        "active": true,
        "description": "In a personal injury case, agent failed to ask whether caller or anyone else was injured.",
        "penalty": -1,
        "subscore": "logistics"
      },
      {
        "id": "agent_used_profanity_or_inappropriate_language",
        "label": "Agent used profanity or inappropriate language",
        "active": true,
        "description": "Agent cursed or used language inappropriate for professional legal services.",
        "penalty": -2,
        "subscore": "human_element"
      }
    ]
  },
  "bonuses": {
    "description": "Award bonus points for genuinely exceptional moments — not for doing the job correctly. Total bonus is capped at +1 per call. Every bonus MUST be documented with a direct transcript quote.",
    "max_total_bonus": 1,
    "items": [
      {
        "id": "exceptional_empathy_and_rapport",
        "label": "Exceptional empathy and rapport",
        "active": true,
        "description": "Agent demonstrated genuinely exceptional empathy, personal connection, or rapport-building that went above and beyond normal expectations.",
        "points": 1,
        "subscore": "human_element"
      },
      {
        "id": "exceptional_efficiency_and_clarity",
        "label": "Exceptional efficiency and clarity",
        "active": true,
        "description": "Agent demonstrated exceptional efficiency, clarity, or problem-solving that significantly exceeded normal expectations.",
        "points": 1,
        "subscore": "logistics"
      }
    ]
  },
  "rating_scale": {
    "description": "Subscores are calculated as: (sum of category scores / max possible) × 100. Both subscores are independent.",
    "tiers": [
      {
        "label": "Exceptional",
        "range": [90, 100],
        "description": "Consistently excellent performance"
      },
      {
        "label": "Exceeds Expectations",
        "range": [80, 89],
        "description": "Strong performance with minor areas for growth"
      },
      {
        "label": "Meets Expectations",
        "range": [65, 79],
        "description": "Adequate performance, meets baseline standards"
      },
      {
        "label": "Needs Improvement",
        "range": [50, 64],
        "description": "Below baseline, coaching recommended"
      },
      {
        "label": "Below Standard",
        "range": [0, 49],
        "description": "Significant performance issues"
      }
    ]
  }
}
